package home.work4.phonebook;

import java.util.ArrayList;

/*
4. Клас Телефонний Довідник зберігає безліч записів типу даних Запис.
5. У класі Телефонний Довідник реалізувати метод add. Метод додає Запис до Телефонного Довідника.
Примітка: Під одним прізвищем може зберігатися кілька телефонів, тому можлива наявність декількох записів.
6. У класі Телефонний Довідник реалізувати метод find(). Метод здійснює пошук конкретного запису на ім'я.
Якщо запис знайдений (перший знайдений), тоді його необхідно повернути, інакше повертається null.
7. Мається на увазі дотримання відомих (на даний момент) правил написання коду в ОВП та правил "Чистоти коду".
8. * У класі Телефонний Довідник реалізувати метод findAll(). Метод здійснює пошук записів на ім'я. Якщо записи знайдені,
тоді їх необхідно повернути, інакше повертається null.
Така реалізація викликана тим, що під одним прізвищем може зберігатися кілька телефонів і при запиті по конкретному імені
необхідно повертати всі записи, що є в наявності.
 */

public class Main {

    public static void main(String[] args) {
        PhoneBook phoneBook = new PhoneBook();
        phoneBook.add("aaa", "12345");
        phoneBook.add("bbb", "1234567");

        System.out.println(phoneBook.find("aaa"));

    }

}
